Revit 2026 API

# BRepBuilderGeometryId Constructor

---

Copy constructor

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public BRepBuilderGeometryId(
	BRepBuilderGeometryId other
)
```
```vb
Public Sub New (
	other As BRepBuilderGeometryId
)
```
```cpp
public:
BRepBuilderGeometryId(
	BRepBuilderGeometryId^ other
)
```
```fsharp
new :
        other : BRepBuilderGeometryId -> BRepBuilderGeometryId
```

#### Parameters

other BRepBuilderGeometryId

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

BRepBuilderGeometryId Class

Autodesk.Revit.DB Namespace